In [2]:
import pandas as pd
import numpy as np

In [3]:
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas","PySpark","Python","pandas"],
    'Fee' :[24000,25000,25000,24000,24000,25000,25000,24000]
               }

In [4]:
df = pd.DataFrame(technologies)

In [5]:
df

   Courses    Fee
0    Spark  24000
1  PySpark  25000
2   Hadoop  25000
3   Python  24000
4   pandas  24000
5  PySpark  25000
6   Python  25000
7   pandas  24000

In [9]:
df['Courses'].values.tolist()  #returns values including duplicates

['Spark',
 'PySpark',
 'Hadoop',
 'Python',
 'pandas',
 'PySpark',
 'Python',
 'pandas']

In [22]:
df['Courses'].value_counts()  #Returns the frequency counts
#Note that NULL,None, np.NaN are ignored during counting

PySpark    2
Python     2
pandas     2
Spark      1
Hadoop     1
Name: Courses, dtype: int64

In [23]:
df.groupby('Courses').count()
#Groupby function returns a GroupBy object

         Fee
Courses
Hadoop     1
PySpark    2
Python     2
Spark      1
pandas     2

In [26]:
df.groupby('Courses')['Courses'].transform('count')

0    1
1    2
2    1
3    2
4    2
5    2
6    2
7    2
Name: Courses, dtype: int64

In [29]:
df.groupby(['Courses','Fee']).size()

Courses  Fee
Hadoop   25000    1
PySpark  25000    2
Python   24000    1
         25000    1
Spark    24000    1
pandas   24000    2
dtype: int64

In [31]:
df.index.value_counts()

7    1
6    1
5    1
4    1
3    1
2    1
1    1
0    1
dtype: int64

In [34]:
df['Courses'].value_counts(dropna = False)
# Handle NaN, None

PySpark    2
Python     2
pandas     2
Spark      1
Hadoop     1
Name: Courses, dtype: int64

In [36]:
df['Courses'].value_counts(normalize = True)

PySpark    0.250
Python     0.250
pandas     0.250
Spark      0.125
Hadoop     0.125
Name: Courses, dtype: float64

In [42]:
df['ColumnTodrop'] = df['Courses'].astype(str) + "-" + df['Fee'].astype(str)

In [43]:
df

   Courses    Fee   ColumnTodrop
0    Spark  24000    Spark-24000
1  PySpark  25000  PySpark-25000
2   Hadoop  25000   Hadoop-25000
3   Python  24000   Python-24000
4   pandas  24000   pandas-24000
5  PySpark  25000  PySpark-25000
6   Python  25000   Python-25000
7   pandas  24000   pandas-24000

In [48]:
df2 = df.drop(['ColumnTodrop'], axis=1)

In [47]:
df

   Courses    Fee   ColumnTodrop
0    Spark  24000    Spark-24000
1  PySpark  25000  PySpark-25000
2   Hadoop  25000   Hadoop-25000
3   Python  24000   Python-24000
4   pandas  24000   pandas-24000
5  PySpark  25000  PySpark-25000
6   Python  25000   Python-25000
7   pandas  24000   pandas-24000

In [49]:
df2

   Courses    Fee
0    Spark  24000
1  PySpark  25000
2   Hadoop  25000
3   Python  24000
4   pandas  24000
5  PySpark  25000
6   Python  25000
7   pandas  24000